# Data Manipulation with Pandas

# Data Manipulation tasks:
    
- Filtering data

- Sorting data

- Group By aggregations

- Adding new columns

- Handling dates

- Handling Strings

- Merging dataframes

- Treating Missing Values

In [1]:
#import packages
import os
import pandas as pd
import numpy as np

In [2]:
#change the working directory
os.chdir("D://Files")

In [3]:
# load the data set 'Store'
store=pd.read_csv("Store.csv")
#store=pd.read_csv("Store.csv",encoding='latin')

In [4]:
#Number of observations
store.shape

(9994, 22)

In [5]:
#Information about the columns/variables in a data set
#object data type represents 'categorical variable'
store.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 9994 entries, 0 to 9993
Data columns (total 22 columns):
Unnamed: 0       9994 non-null int64
Row ID           9994 non-null int64
Order ID         9994 non-null object
Order Date       9994 non-null object
Ship Date        9994 non-null object
Ship Mode        9994 non-null object
Customer ID      9994 non-null object
Customer Name    9994 non-null object
Segment          9994 non-null object
Country          9994 non-null object
City             9994 non-null object
State            9994 non-null object
Postal Code      9994 non-null int64
Region           9994 non-null object
Product ID       9994 non-null object
Category         9994 non-null object
Sub-Category     9994 non-null object
Product Name     9994 non-null object
Sales            9994 non-null float64
Quantity         9994 non-null int64
Discount         9994 non-null float64
Profit           9994 non-null float64
dtypes: float64(3), int64(4), object(15)
memory usage: 1.7+ MB

In [6]:
store.dtypes

Unnamed: 0         int64
Row ID             int64
Order ID          object
Order Date        object
Ship Date         object
Ship Mode         object
Customer ID       object
Customer Name     object
Segment           object
Country           object
City              object
State             object
Postal Code        int64
Region            object
Product ID        object
Category          object
Sub-Category      object
Product Name      object
Sales            float64
Quantity           int64
Discount         float64
Profit           float64
dtype: object

In [7]:
#First 3 observations from the dataset
store.head(3)

,Unnamed: 0,Row ID,Order ID,Order Date,Ship Date,Ship Mode,Customer ID,Customer Name,Segment,Country,...,Postal Code,Region,Product ID,Category,Sub-Category,Product Name,Sales,Quantity,Discount,Profit
0,0,1,CA-2013-152156,11/9/2013,11/12/2013,Second Class,CG-12520,Claire Gute,Consumer,United States,...,42420,South,FUR-BO-10001798,Furniture,Bookcases,Bush Somerset Collection Bookcase,261.96,2,0.0,41.9136
1,1,2,CA-2013-152156,11/9/2013,11/12/2013,Second Class,CG-12520,Claire Gute,Consumer,United States,...,42420,South,FUR-CH-10000454,Furniture,Chairs,"Hon Deluxe Fabric Upholstered Stacking Chairs,...",731.94,3,0.0,219.5820
2,2,3,CA-2013-138688,6/13/2013,6/17/2013,Second Class,DV-13045,Darrin Van Huff,Corporate,United States,...,90036,West,OFF-LA-10000240,Office Supplies,Labels,Self-Adhesive Address Labels for Typewriters b...,14.62,2,0.0,6.8714

In [8]:
#last 2 observations from the data set
store.tail(2)

,Unnamed: 0,Row ID,Order ID,Order Date,Ship Date,Ship Mode,Customer ID,Customer Name,Segment,Country,...,Postal Code,Region,Product ID,Category,Sub-Category,Product Name,Sales,Quantity,Discount,Profit
9992,9992,9993,CA-2014-121258,2/27/2014,3/4/2014,Standard Class,DB-13060,Dave Brooks,Consumer,United States,...,92627,West,OFF-PA-10004041,Office Supplies,Paper,"It's Hot Message Books with Stickers, 2 3/4"" x 5""",29.60,4,0.0,13.320
9993,9993,9994,CA-2014-119914,5/5/2014,5/10/2014,Second Class,CC-12220,Chris Cortes,Consumer,United States,...,92683,West,OFF-AP-10002684,Office Supplies,Appliances,"Acco 7-Outlet Masterpiece Power Center, Wihtou...",243.16,2,0.0,72.948

In [9]:
#Count the number of missing values
store.isnull().sum()

Unnamed: 0       0
Row ID           0
Order ID         0
Order Date       0
Ship Date        0
Ship Mode        0
Customer ID      0
Customer Name    0
Segment          0
Country          0
City             0
State            0
Postal Code      0
Region           0
Product ID       0
Category         0
Sub-Category     0
Product Name     0
Sales            0
Quantity         0
Discount         0
Profit           0
dtype: int64

In [10]:
#Summary statistics for numerical variables
store.describe()

,Unnamed: 0,Row ID,Postal Code,Sales,Quantity,Discount,Profit
count,9994.000000,9994.000000,9994.000000,9994.000000,9994.000000,9994.000000,9994.000000
mean,4996.500000,4997.500000,55190.379428,229.858001,3.789574,0.156203,28.656896
std,2885.163629,2885.163629,32063.693350,623.245101,2.225110,0.206452,234.260108
min,0.000000,1.000000,1040.000000,0.444000,1.000000,0.000000,-6599.978000
25%,2498.250000,2499.250000,23223.000000,17.280000,2.000000,0.000000,1.728750
50%,4996.500000,4997.500000,56430.500000,54.490000,3.000000,0.200000,8.666500
75%,7494.750000,7495.750000,90008.000000,209.940000,5.000000,0.200000,29.364000
max,9993.000000,9994.000000,99301.000000,22638.480000,14.000000,0.800000,8399.976000

In [11]:
#extract two variables from the data set 'store' and find summary statistics
store[['Sales',"Postal Code"]].describe()

              Sales   Postal Code
count   9994.000000   9994.000000
mean     229.858001  55190.379428
std      623.245101  32063.693350
min        0.444000   1040.000000
25%       17.280000  23223.000000
50%       54.490000  56430.500000
75%      209.940000  90008.000000
max    22638.480000  99301.000000

In [12]:
# Finding out how many cities are the orders being delivered to
# We have to print the contents of the city column 
 
cities = store['City']
print(type(cities))
print(len(cities))

<class 'pandas.core.series.Series'>
9994

In [13]:
len(store['City'])

9994

In [14]:
cities=store.City
print(len(cities))

9994

In [15]:
# In the below query, we are trying to find out how many unique cities are the 
                #packages delivered.
cities_uniq = store['City'].unique().tolist() 
# Note : The default type is array, unless u convert it to a list
print(type(cities_uniq))
print(cities_uniq)
print(len(cities_uniq))
#print(len(set(cities)))

<class 'list'>
['Henderson', 'Los Angeles', 'Fort Lauderdale', 'Concord', 'Seattle', 'Fort Worth', 'Madison', 'West Jordan', 'San Francisco', 'Fremont', 'Philadelphia', 'Orem', 'Houston', 'Richardson', 'Naperville', 'Melbourne', 'Eagan', 'Westland', 'Dover', 'New Albany', 'New York City', 'Troy', 'Chicago', 'Gilbert', 'Springfield', 'Jackson', 'Memphis', 'Decatur', 'Durham', 'Columbia', 'Rochester', 'Minneapolis', 'Portland', 'Saint Paul', 'Aurora', 'Charlotte', 'Orland Park', 'Urbandale', 'Columbus', 'Bristol', 'Wilmington', 'Bloomington', 'Phoenix', 'Roseville', 'Independence', 'Pasadena', 'Newark', 'Franklin', 'Scottsdale', 'San Jose', 'Edmond', 'Carlsbad', 'San Antonio', 'Monroe', 'Fairfield', 'Grand Prairie', 'Redlands', 'Hamilton', 'Westfield', 'Akron', 'Denver', 'Dallas', 'Whittier', 'Saginaw', 'Medina', 'Dublin', 'Detroit', 'Tampa', 'Santa Clara', 'Lakeville', 'San Diego', 'Brentwood', 'Chapel Hill', 'Morristown', 'Cincinnati', 'Inglewood', 'Tamarac', 'Colorado Springs', 'Belleville', 'Taylor', 'Lakewood', 'Arlington', 'Arvada', 'Hackensack', 'Saint Petersburg', 'Long Beach', 'Hesperia', 'Murfreesboro', 'Layton', 'Austin', 'Lowell', 'Manchester', 'Harlingen', 'Tucson', 'Quincy', 'Pembroke Pines', 'Des Moines', 'Peoria', 'Las Vegas', 'Warwick', 'Miami', 'Huntington Beach', 'Richmond', 'Louisville', 'Lawrence', 'Canton', 'New Rochelle', 'Gastonia', 'Jacksonville', 'Auburn', 'Norman', 'Park Ridge', 'Amarillo', 'Lindenhurst', 'Huntsville', 'Fayetteville', 'Costa Mesa', 'Parker', 'Atlanta', 'Gladstone', 'Great Falls', 'Lakeland', 'Montgomery', 'Mesa', 'Green Bay', 'Anaheim', 'Marysville', 'Salem', 'Laredo', 'Grove City', 'Dearborn', 'Warner Robins', 'Vallejo', 'Mission Viejo', 'Rochester Hills', 'Plainfield', 'Sierra Vista', 'Vancouver', 'Cleveland', 'Tyler', 'Burlington', 'Waynesboro', 'Chester', 'Cary', 'Palm Coast', 'Mount Vernon', 'Hialeah', 'Oceanside', 'Evanston', 'Trenton', 'Cottage Grove', 'Bossier City', 'Lancaster', 'Asheville', 'Lake Elsinore', 'Omaha', 'Edmonds', 'Santa Ana', 'Milwaukee', 'Florence', 'Lorain', 'Linden', 'Salinas', 'New Brunswick', 'Garland', 'Norwich', 'Alexandria', 'Toledo', 'Farmington', 'Riverside', 'Torrance', 'Round Rock', 'Boca Raton', 'Virginia Beach', 'Murrieta', 'Olympia', 'Washington', 'Jefferson City', 'Saint Peters', 'Rockford', 'Brownsville', 'Yonkers', 'Oakland', 'Clinton', 'Encinitas', 'Roswell', 'Jonesboro', 'Antioch', 'Homestead', 'La Porte', 'Lansing', 'Cuyahoga Falls', 'Reno', 'Harrisonburg', 'Escondido', 'Royal Oak', 'Rockville', 'Coral Springs', 'Buffalo', 'Boynton Beach', 'Gulfport', 'Fresno', 'Greenville', 'Macon', 'Cedar Rapids', 'Providence', 'Pueblo', 'Deltona', 'Murray', 'Middletown', 'Freeport', 'Pico Rivera', 'Provo', 'Pleasant Grove', 'Smyrna', 'Parma', 'Mobile', 'New Bedford', 'Irving', 'Vineland', 'Glendale', 'Niagara Falls', 'Thomasville', 'Westminster', 'Coppell', 'Pomona', 'North Las Vegas', 'Allentown', 'Tempe', 'Laguna Niguel', 'Bridgeton', 'Everett', 'Watertown', 'Appleton', 'Bellevue', 'Allen', 'El Paso', 'Grapevine', 'Carrollton', 'Kent', 'Lafayette', 'Tigard', 'Skokie', 'Plano', 'Suffolk', 'Indianapolis', 'Bayonne', 'Greensboro', 'Baltimore', 'Kenosha', 'Olathe', 'Tulsa', 'Redmond', 'Raleigh', 'Muskogee', 'Meriden', 'Bowling Green', 'South Bend', 'Spokane', 'Keller', 'Port Orange', 'Medford', 'Charlottesville', 'Missoula', 'Apopka', 'Reading', 'Broomfield', 'Paterson', 'Oklahoma City', 'Chesapeake', 'Lubbock', 'Johnson City', 'San Bernardino', 'Leominster', 'Bozeman', 'Perth Amboy', 'Ontario', 'Rancho Cucamonga', 'Moorhead', 'Mesquite', 'Stockton', 'Ormond Beach', 'Sunnyvale', 'York', 'College Station', 'Saint Louis', 'Manteca', 'San Angelo', 'Salt Lake City', 'Knoxville', 'Little Rock', 'Lincoln Park', 'Marion', 'Littleton', 'Bangor', 'Southaven', 'New Castle', 'Midland', 'Sioux Falls', 'Fort Collins', 'Clarksville', 'Sacramento', 'Thousand Oaks', 'Malden', 'Holyoke', 'Albuquerque', 'Sparks', 'Coachella', 'Elmhurst', 'Passaic', 'North Charleston', 'Newport News', 'Jamestown', 'Mishawaka', 'La Quinta', 'Tallahassee', 'Nashville', 'Bellingham', 'Woodstock', 'Haltom City', 'Wheeling', 'Summerville', 'Hot Springs', 'Englewood', 'Las Cruces', 'Hoover', 'Frisco', 'Vacaville', 'Waukesha', 'Bakersfield', 'Pompano Beach', 'Corpus Christi', 'Redondo Beach', 'Orlando', 'Orange', 'Lake Charles', 'Highland Park', 'Hempstead', 'Noblesville', 'Apple Valley', 'Mount Pleasant', 'Sterling Heights', 'Eau Claire', 'Pharr', 'Billings', 'Gresham', 'Chattanooga', 'Meridian', 'Bolingbrook', 'Maple Grove', 'Woodland', 'Missouri City', 'Pearland', 'San Mateo', 'Grand Rapids', 'Visalia', 'Overland Park', 'Temecula', 'Yucaipa', 'Revere', 'Conroe', 'Tinley Park', 'Dubuque', 'Dearborn Heights', 'Santa Fe', 'Hickory', 'Carol Stream', 'Saint Cloud', 'North Miami', 'Plantation', 'Port Saint Lucie', 'Rock Hill', 'Odessa', 'West Allis', 'Chula Vista', 'Manhattan', 'Altoona', 'Thornton', 'Champaign', 'Texarkana', 'Edinburg', 'Baytown', 'Greenwood', 'Woonsocket', 'Superior', 'Bedford', 'Covington', 'Broken Arrow', 'Miramar', 'Hollywood', 'Deer Park', 'Wichita', 'Mcallen', 'Iowa City', 'Boise', 'Cranston', 'Port Arthur', 'Citrus Heights', 'The Colony', 'Daytona Beach', 'Bullhead City', 'Portage', 'Fargo', 'Elkhart', 'San Gabriel', 'Margate', 'Sandy Springs', 'Mentor', 'Lawton', 'Hampton', 'Rome', 'La Crosse', 'Lewiston', 'Hattiesburg', 'Danville', 'Logan', 'Waterbury', 'Athens', 'Avondale', 'Marietta', 'Yuma', 'Wausau', 'Pasco', 'Oak Park', 'Pensacola', 'League City', 'Gaithersburg', 'Lehi', 'Tuscaloosa', 'Moreno Valley', 'Georgetown', 'Loveland', 'Chandler', 'Helena', 'Kirkwood', 'Waco', 'Frankfort', 'Bethlehem', 'Grand Island', 'Woodbury', 'Rogers', 'Clovis', 'Jupiter', 'Santa Barbara', 'Cedar Hill', 'Norfolk', 'Draper', 'Ann Arbor', 'La Mesa', 'Pocatello', 'Holland', 'Milford', 'Buffalo Grove', 'Lake Forest', 'Redding', 'Chico', 'Utica', 'Conway', 'Cheyenne', 'Owensboro', 'Caldwell', 'Kenner', 'Nashua', 'Bartlett', 'Redwood City', 'Lebanon', 'Santa Maria', 'Des Plaines', 'Longview', 'Hendersonville', 'Waterloo', 'Cambridge', 'Palatine', 'Beverly', 'Eugene', 'Oxnard', 'Renton', 'Glenview', 'Delray Beach', 'Commerce City', 'Texas City', 'Wilson', 'Rio Rancho', 'Goldsboro', 'Montebello', 'El Cajon', 'Beaumont', 'West Palm Beach', 'Abilene', 'Normal', 'Saint Charles', 'Camarillo', 'Hillsboro', 'Burbank', 'Modesto', 'Garden City', 'Atlantic City', 'Longmont', 'Davis', 'Morgan Hill', 'Clifton', 'Sheboygan', 'East Point', 'Rapid City', 'Andover', 'Kissimmee', 'Shelton', 'Danbury', 'Sanford', 'San Marcos', 'Greeley', 'Mansfield', 'Elyria', 'Twin Falls', 'Coral Gables', 'Romeoville', 'Marlborough', 'Laurel', 'Bryan', 'Pine Bluff', 'Aberdeen', 'Hagerstown', 'East Orange', 'Arlington Heights', 'Oswego', 'Coon Rapids', 'San Clemente', 'San Luis Obispo', 'Springdale', 'Lodi', 'Mason']
531

In [16]:
#Unique levels in the Segment variable
store['Segment'].unique()

array(['Consumer', 'Corporate', 'Home Office'], dtype=object)

# Filter

In [17]:
#filter the data
#Filter the data by segments are consumer
#logical indexation [data[logical condition]]
#query method [data.query('logical condition')]

In [18]:
#logical indexation
store[store['Segment']=='Consumer'].head(2)

,Unnamed: 0,Row ID,Order ID,Order Date,Ship Date,Ship Mode,Customer ID,Customer Name,Segment,Country,...,Postal Code,Region,Product ID,Category,Sub-Category,Product Name,Sales,Quantity,Discount,Profit
0,0,1,CA-2013-152156,11/9/2013,11/12/2013,Second Class,CG-12520,Claire Gute,Consumer,United States,...,42420,South,FUR-BO-10001798,Furniture,Bookcases,Bush Somerset Collection Bookcase,261.96,2,0.0,41.9136
1,1,2,CA-2013-152156,11/9/2013,11/12/2013,Second Class,CG-12520,Claire Gute,Consumer,United States,...,42420,South,FUR-CH-10000454,Furniture,Chairs,"Hon Deluxe Fabric Upholstered Stacking Chairs,...",731.94,3,0.0,219.5820

In [19]:
#query method
store.query('Segment=="Consumer"').head(2)

,Unnamed: 0,Row ID,Order ID,Order Date,Ship Date,Ship Mode,Customer ID,Customer Name,Segment,Country,...,Postal Code,Region,Product ID,Category,Sub-Category,Product Name,Sales,Quantity,Discount,Profit
0,0,1,CA-2013-152156,11/9/2013,11/12/2013,Second Class,CG-12520,Claire Gute,Consumer,United States,...,42420,South,FUR-BO-10001798,Furniture,Bookcases,Bush Somerset Collection Bookcase,261.96,2,0.0,41.9136
1,1,2,CA-2013-152156,11/9/2013,11/12/2013,Second Class,CG-12520,Claire Gute,Consumer,United States,...,42420,South,FUR-CH-10000454,Furniture,Chairs,"Hon Deluxe Fabric Upholstered Stacking Chairs,...",731.94,3,0.0,219.5820

In [20]:
#store.query('Ship Mode=="Second Class"').head(2)  # gives error (space in the variable name)
store[store['Ship Mode']=='Second Class'].head(2)

,Unnamed: 0,Row ID,Order ID,Order Date,Ship Date,Ship Mode,Customer ID,Customer Name,Segment,Country,...,Postal Code,Region,Product ID,Category,Sub-Category,Product Name,Sales,Quantity,Discount,Profit
0,0,1,CA-2013-152156,11/9/2013,11/12/2013,Second Class,CG-12520,Claire Gute,Consumer,United States,...,42420,South,FUR-BO-10001798,Furniture,Bookcases,Bush Somerset Collection Bookcase,261.96,2,0.0,41.9136
1,1,2,CA-2013-152156,11/9/2013,11/12/2013,Second Class,CG-12520,Claire Gute,Consumer,United States,...,42420,South,FUR-CH-10000454,Furniture,Chairs,"Hon Deluxe Fabric Upholstered Stacking Chairs,...",731.94,3,0.0,219.5820

In [21]:
#Multiple conditions
#how many orders were placed for region south and for segment consumer
#data[(l1)&(l2)&(l3)]
#data[(l1)|(l2)]
store[(store['Region']=="South") & (store['Segment']=="Consumer")].shape[0]
#save filtered dataset into local directory
store1=store[(store['Region']=="South") & (store['Segment']=="Consumer")]
store1.to_csv("D://Python//Filtered1.csv")

In [22]:
# 'or' condition
store[(store['Region']=="North") | (store['Segment']=="Consumer")].shape[0]

5191

In [23]:
#data.query('l1 & l2')
store.query('Region=="South" & Segment=="Consumer"').shape[0]
#store.query('Region=="North" | Segment=="Consumer"').shape[0]

838

In [24]:
#find how many transactions from region south had a profit >50

store.query('Region=="South" & Profit>50').shape[0]
#store[(store['Region'] =="South") & (store['Profit']>50)].shape[0]

323

In [25]:
# In class exercise :
#Write a code snippet to find out how many instances of packages delivered to Los Angeles
store.query('City=="Los Angeles"').shape[0]

747

In [26]:
# How many times orders were shipped to the east region ?
store.query('Region=="East"').shape[0]

2848

In [27]:
# How to figure out the total quantity of products shipped to the east zone ?
store.query('Region=="East"')['Quantity'].sum() # This will give us only the quantity column values
#store.query('Region=="East"').sum()

10618

# Sorting

In [28]:
#sorting the data
#sort_values() method to sort the values
#sort data by profit
store.sort_values("Profit").head(2)

,Unnamed: 0,Row ID,Order ID,Order Date,Ship Date,Ship Mode,Customer ID,Customer Name,Segment,Country,...,Postal Code,Region,Product ID,Category,Sub-Category,Product Name,Sales,Quantity,Discount,Profit
7772,7772,7773,CA-2013-108196,11/26/2013,12/3/2013,Standard Class,CS-12505,Cindy Stewart,Consumer,United States,...,43130,East,TEC-MA-10000418,Technology,Machines,Cubify CubeX 3D Printer Double Head Print,4499.985,5,0.7,-6599.9780
683,683,684,US-2014-168116,11/5/2014,11/5/2014,Same Day,GT-14635,Grant Thornton,Corporate,United States,...,27217,South,TEC-MA-10004125,Technology,Machines,Cubify CubeX 3D Printer Triple Head Print,7999.980,4,0.5,-3839.9904

In [29]:
#descending order
store.sort_values("Profit",ascending=False).head(2)

,Unnamed: 0,Row ID,Order ID,Order Date,Ship Date,Ship Mode,Customer ID,Customer Name,Segment,Country,...,Postal Code,Region,Product ID,Category,Sub-Category,Product Name,Sales,Quantity,Discount,Profit
6826,6826,6827,CA-2013-118689,10/3/2013,10/10/2013,Standard Class,TC-20980,Tamara Chand,Corporate,United States,...,47905,Central,TEC-CO-10004722,Technology,Copiers,Canon imageCLASS 2200 Advanced Copier,17499.95,5,0.0,8399.9760
8153,8153,8154,CA-2014-140151,3/24/2014,3/26/2014,First Class,RB-19360,Raymond Buch,Consumer,United States,...,98115,West,TEC-CO-10004722,Technology,Copiers,Canon imageCLASS 2200 Advanced Copier,13999.96,4,0.0,6719.9808

In [30]:
#class exercise
## Sorting data
# Which are the most valuable customers in South Region by Sales?

In [31]:
store.query("Region=='South'").sort_values('Sales',ascending=False).head(2)
#store[store['Region']=='South'].sort_values('Sales',ascending=False).head(2)

,Unnamed: 0,Row ID,Order ID,Order Date,Ship Date,Ship Mode,Customer ID,Customer Name,Segment,Country,...,Postal Code,Region,Product ID,Category,Sub-Category,Product Name,Sales,Quantity,Discount,Profit
2697,2697,2698,CA-2011-145317,3/18/2011,3/23/2011,Standard Class,SM-20320,Sean Miller,Home Office,United States,...,32216,South,TEC-MA-10002412,Technology,Machines,Cisco TelePresence System EX90 Videoconferenci...,22638.48,6,0.5,-1811.0784
8488,8488,8489,CA-2013-158841,2/2/2013,2/4/2013,Second Class,SE-20110,Sanjit Engle,Consumer,United States,...,22204,South,TEC-MA-10001127,Technology,Machines,HP Designjet T520 Inkjet Large Format Printer ...,8749.95,5,0.0,2799.9840

In [32]:
#sort by two variables
store.sort_values(['Profit','Sales'],ascending=[False,True]).head(2)

,Unnamed: 0,Row ID,Order ID,Order Date,Ship Date,Ship Mode,Customer ID,Customer Name,Segment,Country,...,Postal Code,Region,Product ID,Category,Sub-Category,Product Name,Sales,Quantity,Discount,Profit
6826,6826,6827,CA-2013-118689,10/3/2013,10/10/2013,Standard Class,TC-20980,Tamara Chand,Corporate,United States,...,47905,Central,TEC-CO-10004722,Technology,Copiers,Canon imageCLASS 2200 Advanced Copier,17499.95,5,0.0,8399.9760
8153,8153,8154,CA-2014-140151,3/24/2014,3/26/2014,First Class,RB-19360,Raymond Buch,Consumer,United States,...,98115,West,TEC-CO-10004722,Technology,Copiers,Canon imageCLASS 2200 Advanced Copier,13999.96,4,0.0,6719.9808

In [33]:
#How to identify the top 10 customers in the south region
#              (top 10 in terms of sale amount and discount)

In [34]:

store.query("Region=='South'").sort_values(['Sales','Discount'],ascending=[False,True]).head(10)

,Unnamed: 0,Row ID,Order ID,Order Date,Ship Date,Ship Mode,Customer ID,Customer Name,Segment,Country,...,Postal Code,Region,Product ID,Category,Sub-Category,Product Name,Sales,Quantity,Discount,Profit
2697,2697,2698,CA-2011-145317,3/18/2011,3/23/2011,Standard Class,SM-20320,Sean Miller,Home Office,United States,...,32216,South,TEC-MA-10002412,Technology,Machines,Cisco TelePresence System EX90 Videoconferenci...,22638.480,6,0.5,-1811.0784
8488,8488,8489,CA-2013-158841,2/2/2013,2/4/2013,Second Class,SE-20110,Sanjit Engle,Consumer,United States,...,22204,South,TEC-MA-10001127,Technology,Machines,HP Designjet T520 Inkjet Large Format Printer ...,8749.950,5,0.0,2799.9840
683,683,684,US-2014-168116,11/5/2014,11/5/2014,Same Day,GT-14635,Grant Thornton,Corporate,United States,...,27217,South,TEC-MA-10004125,Technology,Machines,Cubify CubeX 3D Printer Triple Head Print,7999.980,4,0.5,-3839.9904
509,509,510,CA-2012-145352,3/16/2012,3/22/2012,Standard Class,CM-12385,Christopher Martinez,Consumer,United States,...,30318,South,OFF-BI-10003527,Office Supplies,Binders,Fellowes PB500 Electric Punch Plastic Comb Bin...,6354.950,5,0.0,3177.4750
4297,4297,4298,CA-2014-129021,8/24/2014,8/27/2014,Second Class,PO-18850,Patrick O'Brill,Consumer,United States,...,32303,South,TEC-PH-10001459,Technology,Phones,Samsung Galaxy Mega 6.3,4367.896,13,0.2,327.5922
9639,9639,9640,CA-2012-116638,1/28/2012,1/31/2012,Second Class,JH-15985,Joseph Holt,Consumer,United States,...,28027,South,FUR-TA-10000198,Furniture,Tables,Chromcraft Bull-Nose Wood Oval Conference Tabl...,4297.644,13,0.4,-1862.3124
3280,3280,3281,CA-2011-102988,4/5/2011,4/9/2011,Second Class,GM-14695,Greg Maxwell,Corporate,United States,...,22304,South,OFF-SU-10002881,Office Supplies,Supplies,Martin Yale Chadless Opener Electric Letter Op...,4164.050,5,0.0,83.2810
7583,7583,7584,CA-2011-163223,3/21/2011,3/25/2011,Standard Class,KH-16690,Kristen Hastings,Corporate,United States,...,22153,South,TEC-PH-10000730,Technology,Phones,Samsung Galaxy S4 Active,3499.930,7,0.0,909.9818
4093,4093,4094,CA-2012-102491,8/24/2012,8/28/2012,Standard Class,KW-16435,Katrina Willman,Consumer,United States,...,41042,South,TEC-MA-10000864,Technology,Machines,Cisco 9971 IP Video Phone Charcoal,3080.000,7,0.0,1416.8000
1454,1454,1455,CA-2013-133711,11/27/2013,11/30/2013,First Class,MC-17425,Mark Cousins,Corporate,United States,...,36608,South,TEC-MA-10000010,Technology,Machines,Hewlett-Packard Deskjet 3050a All-in-One Color...,3040.000,8,0.0,1459.2000

In [35]:
# class exercise
#How to identify the top 10 customers in the south region (top 10 in terms of sale amount,discount ) ?

#Give only customer name

In [36]:
 
store.query("Region=='South'").sort_values(['Sales','Discount'],ascending=[False,True])['Customer Name'].head(10)

2697             Sean Miller
8488            Sanjit Engle
683           Grant Thornton
509     Christopher Martinez
4297         Patrick O'Brill
9639             Joseph Holt
3280            Greg Maxwell
7583        Kristen Hastings
4093         Katrina Willman
1454            Mark Cousins
Name: Customer Name, dtype: object

In [37]:
#Add Customer Id also
store.query("Region=='South'").sort_values(['Sales','Discount'],ascending=[False,True])[['Customer Name','Customer ID']].head(2)

     Customer Name Customer ID
2697   Sean Miller    SM-20320
8488  Sanjit Engle    SE-20110

In [38]:
# In the East Region who are the most profitable customers? Top 10.(in terms of Sales)
store.query('Region=="East"').sort_values('Sales',ascending=False)['Customer Name'].head(2)

2623    Tom Ashbrook
4190    Hunter Lopez
Name: Customer Name, dtype: object

In [39]:
#Figure out the bottom 3 (least ranked customers based on the sale amount) with zones

In [40]:
store.sort_values('Sales')[['Region','Sales']].head(3)

       Region  Sales
4101  Central  0.444
9292  Central  0.556
8658  Central  0.836

In [41]:
store.sort_values('Sales',ascending=False)[['Region','Sales']].tail(3)

       Region  Sales
8658  Central  0.836
9292  Central  0.556
4101  Central  0.444

# Group By
# Groupby task(split the data into groups based on some criteria)

In [42]:
# I need the sum of the sale amount for each state 

state_group=store.groupby('State',as_index=False)# Already we have done the group by

#store.groupby('State').reset_index()

# Here as_index=False/ reset_index()method represent don't keep State variable as index
state_group

#agg method

In [43]:
sales_sum = state_group.agg({"Sales":'sum' }).head(2)
#store.groupby('State',as_index=False).agg({"Sales":'sum'}).head(2)
#store.groupby('State',as_index=False).agg({"Sales":np.sum}).head(2)
#store.groupby('State').agg({"Sales":'sum'}).reset_index().head(2)

In [44]:
sales_sum

     State      Sales
0  Alabama  19510.640
1  Arizona  35282.001

In [45]:
store.groupby('State',as_index=False)['Sales'].sum().head(2)

     State      Sales
0  Alabama  19510.640
1  Arizona  35282.001

In [46]:
store.groupby('State').agg({'Sales':np.sum,'Profit':np.max}).head(2)
#store.groupby('State')['Sales','Profit'].agg(['sum','max']).head(2)

             Sales     Profit
State
Alabama  19510.640  1459.2000
Arizona  35282.001   211.4955

In [47]:
store.groupby('Region').agg({'Sales':np.sum,'Profit':np.mean}).reset_index().head()

    Region        Sales     Profit
0  Central  501239.8908  17.092709
1     East  678781.2400  32.135808
2    South  391721.9050  28.857673
3     West  725457.8245  33.849032

In [48]:
store.groupby(['State','City']).agg({'Sales':'max','Profit':np.mean}).reset_index().head()

     State        City    Sales      Profit
0  Alabama      Auburn   900.08   75.434517
1  Alabama     Decatur  1215.92   76.929854
2  Alabama    Florence  1819.86   49.731780
3  Alabama      Hoover   477.24    4.679325
4  Alabama  Huntsville  1319.96  100.525720

In [49]:
store.groupby(['State','City']).agg({'Sales':'max','Profit':np.mean}).head()

                      Sales      Profit
State   City
Alabama Auburn       900.08   75.434517
        Decatur     1215.92   76.929854
        Florence    1819.86   49.731780
        Hoover       477.24    4.679325
        Huntsville  1319.96  100.525720

In [50]:
#Filter the data by East Region, find the maximum sales by Category wise

In [51]:
store.query('Region=="East"').groupby('Category').agg({'Sales':'max'})

                     Sales
Category
Furniture         4416.174
Office Supplies   4663.736
Technology       11199.968

In [52]:
store.query('Region=="East"').groupby('Category').agg({'Sales':'max'}).sort_values('Sales',ascending=False)

                     Sales
Category
Technology       11199.968
Office Supplies   4663.736
Furniture         4416.174

In [53]:
# What is the average quantity sold by region?
#Find average profit by region
#Find out the top 5 states in terms of sale amount

In [54]:
store.groupby("Region").agg({'Quantity':'mean'})

         Quantity
Region
Central  3.779595
East     3.728230
South    3.832716
West     3.829535

In [55]:
store.groupby('Region',as_index=False).agg('Profit':'mean')

SyntaxError: invalid syntax (<ipython-input-55-4dfc72540cc8>, line 1)

In [56]:
store.groupby('State').agg({'Sales':'sum'}).sort_values("Sales",ascending=False).head()

                    Sales
State
California    457687.6315
New York      310876.2710
Texas         170188.0458
Washington    138641.2700
Pennsylvania  116511.9140

# Renaming the columns

In [57]:
store.groupby("Segment",as_index=False).agg({'Discount':np.mean}).rename(columns={"Discount":"Average Discount"})
                                   
#store.rename(columns={"Customer Name":"Customer_Name"})

       Segment  Average Discount
0     Consumer          0.158141
1    Corporate          0.158228
2  Home Office          0.147128

In [58]:
store.head(2)

,Unnamed: 0,Row ID,Order ID,Order Date,Ship Date,Ship Mode,Customer ID,Customer Name,Segment,Country,...,Postal Code,Region,Product ID,Category,Sub-Category,Product Name,Sales,Quantity,Discount,Profit
0,0,1,CA-2013-152156,11/9/2013,11/12/2013,Second Class,CG-12520,Claire Gute,Consumer,United States,...,42420,South,FUR-BO-10001798,Furniture,Bookcases,Bush Somerset Collection Bookcase,261.96,2,0.0,41.9136
1,1,2,CA-2013-152156,11/9/2013,11/12/2013,Second Class,CG-12520,Claire Gute,Consumer,United States,...,42420,South,FUR-CH-10000454,Furniture,Chairs,"Hon Deluxe Fabric Upholstered Stacking Chairs,...",731.94,3,0.0,219.5820

In [59]:
#Rename Sales as "Average Sales"
store.groupby("Segment",as_index=False).agg({'Discount':np.mean,'Sales':'max'})
                          .rename(columns={"Sales":"Average Sales"})
                                                                                                'Sales':'Max Sales'})

IndentationError: unexpected indent (<ipython-input-59-6cca365fedbe>, line 3)

In [61]:
# What are the top 5 categories that give maximum profit?
store.groupby("Category",as_index=False).agg({"Profit":np.max}).sort_values("Profit",ascending=False)

          Category    Profit
2       Technology  8399.976
1  Office Supplies  4946.370
0        Furniture  1013.127

# Adding new columns

In [62]:
## Adding new columns
# Comparing Sales per order with the average sales? 
store["Hi_Low"]=(store['Sales'])/(store['Sales'].mean())
store.head(2)

,Unnamed: 0,Row ID,Order ID,Order Date,Ship Date,Ship Mode,Customer ID,Customer Name,Segment,Country,...,Region,Product ID,Category,Sub-Category,Product Name,Sales,Quantity,Discount,Profit,Hi_Low
0,0,1,CA-2013-152156,11/9/2013,11/12/2013,Second Class,CG-12520,Claire Gute,Consumer,United States,...,South,FUR-BO-10001798,Furniture,Bookcases,Bush Somerset Collection Bookcase,261.96,2,0.0,41.9136,1.139660
1,1,2,CA-2013-152156,11/9/2013,11/12/2013,Second Class,CG-12520,Claire Gute,Consumer,United States,...,South,FUR-CH-10000454,Furniture,Chairs,"Hon Deluxe Fabric Upholstered Stacking Chairs,...",731.94,3,0.0,219.5820,3.184314

In [63]:
#Create Cost price variable
store["Cost"]=(store['Sales'])-(store['Profit'])

# Apply method in a data frame

In [64]:
#Apply method
# What is the Total Sales, Quantity, Discount, Profit .
def get_sum(x):
    return np.sum(x)  # In this function we were finding out the sum of all column values 

store[["Sales","Quantity","Discount","Profit"]].apply(get_sum,axis=0) 
#axis=0 Function is to be applied on each column on data.
                                                                      #along the rows

Sales       2.297201e+06
Quantity    3.787300e+04
Discount    1.561090e+03
Profit      2.863970e+05
dtype: float64

In [65]:
def new1(x):
    if (x["Region"]=="South") | (x["Ship Mode"]=="Second Class"):
        return "high"
    else:
        return "Low"
store['Hi_L']=store.apply(new1,axis=1) # axis= 1 along the columns

In [66]:
store.head(2)

,Unnamed: 0,Row ID,Order ID,Order Date,Ship Date,Ship Mode,Customer ID,Customer Name,Segment,Country,...,Category,Sub-Category,Product Name,Sales,Quantity,Discount,Profit,Hi_Low,Cost,Hi_L
0,0,1,CA-2013-152156,11/9/2013,11/12/2013,Second Class,CG-12520,Claire Gute,Consumer,United States,...,Furniture,Bookcases,Bush Somerset Collection Bookcase,261.96,2,0.0,41.9136,1.139660,220.0464,high
1,1,2,CA-2013-152156,11/9/2013,11/12/2013,Second Class,CG-12520,Claire Gute,Consumer,United States,...,Furniture,Chairs,"Hon Deluxe Fabric Upholstered Stacking Chairs,...",731.94,3,0.0,219.5820,3.184314,512.3580,high

# map function

In [68]:

def new(x):
    if x>3000:
        return 'High'
    elif 1000<x<3000:
        return 'Middle'
    else:
        return 'Low'
store['Salesnew']=store['Sales'].map(new)

In [69]:
def flag(df):
    if (df['Category']=="Furniture") & (df['Sales']<=3000):
        return 1
    else:
        return 0
store['label']=store.apply(flag,axis=1)

In [ ]:
store.head(2)

In [ ]:
store['profit_flag'] = (store['Profit'] > 5000).map({True:'HIGH', False:'LOW'})

store.head(2)

# Working with date time functions 

datetime is a data type in pandas

In [71]:
## Datetime
# Find how much time it takes to place an order and ship the product
#to_datetime() helps to convert an object into date object
store['Order Date']=pd.to_datetime(store['Order Date'])
store['Ship Date']=pd.to_datetime(store['Ship Date'])
print(store['Order Date'].dtypes)

datetime64[ns]

In [72]:
store['duration']=store['Ship Date']-store['Order Date']
store.head(2)

,Unnamed: 0,Row ID,Order ID,Order Date,Ship Date,Ship Mode,Customer ID,Customer Name,Segment,Country,...,Sales,Quantity,Discount,Profit,Hi_Low,Cost,Hi_L,Salesnew,label,duration
0,0,1,CA-2013-152156,2013-11-09,2013-11-12,Second Class,CG-12520,Claire Gute,Consumer,United States,...,261.96,2,0.0,41.9136,1.139660,220.0464,high,Low,1,3 days
1,1,2,CA-2013-152156,2013-11-09,2013-11-12,Second Class,CG-12520,Claire Gute,Consumer,United States,...,731.94,3,0.0,219.5820,3.184314,512.3580,high,Low,1,3 days

In [75]:
# How many times has it taken more than 5 days from placing an order to shipping
store[store['duration']>'5 days'].shape[0]

1822

In [77]:
store['duration'].dtypes

dtype('<m8[ns]')

In [78]:
# What is the probability of shipping time exceeding 5 days 
store[store['duration']>'5 days'].shape[0]/store.shape[0]

0.18230938563137883

In [79]:
# What are the product category for which the shipping time is greater than 5 days 
store[store['duration']>'5 days'].groupby("Category").agg({"Category":'size'})

                 Category
Category
Furniture             365
Office Supplies      1131
Technology            326

In [82]:
#Which are the cities to which the shipping time is 1 day (Display only the cities)
#store[store['duration']=='1 day']['City'].head()
store[store['duration']=='1 day'].groupby("City").agg({"City":'size'}).head(4)

           City
City
Allen         2
Altoona       2
Ann Arbor     1
Antioch       1

In [ ]:
#Changing date formats
store["Ship Date"].dt.strftime("%d/%m/%Y").head(2)

#https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.Period.strftime.html
%b- 1st three characters of the month name
%d- day of the month
%Y- year in four digit format
%H- hour
%M- minute
%S- second
%a- 1st three characters of the weekday
%A- ful name of the weekday
%B- full name of the month
%w- weekday as a number (0 to 6)
%m-month as a number
%y- year in two digit format

In [83]:
store['Order Date'].dt.strftime('%y-%m-%d %H:%M').head(2)

0    13-11-09 00:00
1    13-11-09 00:00
Name: Order Date, dtype: object

In [93]:
df = pd.DataFrame() 
# Create 6 dates 
df['time'] = pd.date_range('2/5/2019', periods = 6, freq ='2H32T')
#H:hours,T:minutes,S:seconds,M:months;D:days,Y:years 
print(df['time'])

0   2019-02-05 00:00:00
1   2019-02-05 02:32:00
2   2019-02-05 05:04:00
3   2019-02-05 07:36:00
4   2019-02-05 10:08:00
5   2019-02-05 12:40:00
Name: time, dtype: datetime64[ns]

In [ ]:
#Extract features - year, month, day, hour, and minute 
df['year'] = df['time'].dt.year 
df['month'] = df['time'].dt.month 
df['day'] = df['time'].dt.day 
df['hour'] = df['time'].dt.hour 
df['minute'] = df['time'].dt.minute
print(df)
#Extract days of week and then print 

print(df['time'].dt.weekday_name)

In [ ]:
#weekday returns numerical value: 0-'monday', 6-'sunday'

print(df['Time'].dt.weekday)

# Combining data frames using concat function

In [95]:
data1=pd.read_csv("Sales_Sep.csv")
data2=pd.read_csv("Sales_Oct.csv")

In [97]:
data1.head()

  Cust_ID  Sales_Amount
0     CS1          1000
1     CS2           900
2     CS3           875
3     CS4           230
4     CS5           987

In [98]:
data1.shape[0]

10

In [99]:
data2.head()

  Cust_ID  Sales_Amount
0     CS1          1000
1     CS2           890
2     CS3           900
3     CS4           450
4     CS8           980

In [100]:
data2.shape[0]

12

In [104]:
# Concatenate 
row_concat = pd.concat([data1, data2])
#row_concat.head(22)

In [ ]:
#export a file to working directory
row_concat.to_csv("D://Files//newfile.csv")

# Combining data frames using merge function

In [105]:
## Merging DataFrames
df1=pd.DataFrame({'CustomerID':[1,2,3,4,5,6],'Product':['Television','Television','Television',
                                                        'Earphones','Earphones','Earphones']})
df2=pd.DataFrame({'CustomerID':[2,4,6],'State':['Texas','Texas','Seattle']})

In [108]:
df1.head(2)

   CustomerID     Product
0           1  Television
1           2  Television

In [109]:
df2.head(2)

   CustomerID  State
0           2  Texas
1           4  Texas

In [110]:
#outer join:Every records will appear
pd.merge(df1, df2, how='outer',on='CustomerID')
#pd.merge(data1,data2,how='outer',on='Cust_ID').head()

   CustomerID     Product    State
0           1  Television      NaN
1           2  Television    Texas
2           3  Television      NaN
3           4   Earphones    Texas
4           5   Earphones      NaN
5           6   Earphones  Seattle

In [ ]:
#inner join: only matcing records will appear
pd.merge(df1,df2,how='inner',on='CustomerID')
#pd.merge(data1,data2,how='inner',on='Cust_ID')

In [ ]:
pd.merge(df1,df2,how='left',on='CustomerID')
#pd.merge(data1,data2,how='left',on='Cust_ID')
#left merge:
#Data frame df1 will be keep as it as and on the basis of common variable merge dataframe df2

In [ ]:
#right join: df2 will be keep as it is and on the basis of common variable merge data frame df1
pd.merge(df1,df2,how='right',on='CustomerID')
#pd.merge(data1,data2,how='right',on='Cust_ID')

In [ ]:
#drop a column
df1.drop('CustomerID',axis=1)
#axis=1:along the columns

# Working with string manipulation functions

In [122]:
st=pd.read_csv("Strings.csv")

In [123]:
st.head(2)

   Age    Income_M Expenses
0   10  Rs 12000/-    8,000
1   30  Rs 45000/-   21,000

In [124]:
st.dtypes

Age          int64
Income_M    object
Expenses    object
dtype: object

In [126]:
# We cannot directly apply mean funtion on the income column of the above data frame as the income 
# column is stored as a string type and not a numeric type. 
#st['Income_M'].mean()

In [127]:
st['Income_M']=st['Income_M'].str.replace("Rs" ,"")
#st['Income_M']=st['Income_M'].str.replace("[Rs /-]" ,"")
print (st.head(2))
print(st.dtypes)

   Age  Income_M Expenses
0   10   12000/-    8,000
1   30   45000/-   21,000
Age          int64
Income_M    object
Expenses    object
dtype: object

In [128]:
st['Income_M']=st['Income_M'].str.replace("/-","")
print (st.head(2))

   Age Income_M Expenses
0   10    12000    8,000
1   30    45000   21,000

In [129]:
st.Income_M=pd.to_numeric(st.Income_M)

In [130]:
st['Income_M'].mean()

36600.0

# Handling Character(Categorical) data using dummies

In [132]:
dat=pd.read_csv("medal.csv", encoding="latin")
dat.head(2)

,City,Edition,Sport,Discipline,Athlete,NOC,Gender,Event,Event_gender,Medal
0,Athens,1896,Aquatics,Swimming,"HAJOS, Alfred",HUN,Men,100m freestyle,M,Gold
1,Athens,1896,Aquatics,Swimming,"HERSCHMANN, Otto",AUT,Men,100m freestyle,M,Silver

In [135]:
dummies = pd.get_dummies(dat)

In [136]:
dummies.head(3)

,Edition,City_Amsterdam,City_Antwerp,City_Athens,City_Atlanta,City_Barcelona,City_Beijing,City_Berlin,City_Helsinki,City_London,...,Event_ÃƒÂ©pÃƒÂ©e individual,Event_ÃƒÂ©pÃƒÂ©e team,"Event_ÃƒÂ©pÃƒÂ©e, amateurs and masters","Event_ÃƒÂ©pÃƒÂ©e, masters",Event_gender_M,Event_gender_W,Event_gender_X,Medal_Bronze,Medal_Gold,Medal_Silver
0,1896,0,0,1,0,0,0,0,0,0,...,0,0,0,0,1,0,0,0,1,0
1,1896,0,0,1,0,0,0,0,0,0,...,0,0,0,0,1,0,0,0,0,1
2,1896,0,0,1,0,0,0,0,0,0,...,0,0,0,0,1,0,0,1,0,0

# Handling missing values

In [138]:
# Counting the number of missing values in each column
dat_m=pd.read_csv('credit_history.csv',na_values=['Missing',""])
# If there are any blank spaces or keyword Missing in the 
#source CSV file, they will be replaced with NAN

In [139]:
dat_m.isnull().sum()

default        0
amount         0
grade          0
years        279
ownership      0
income         0
age            0
dtype: int64

In [140]:
#summary statistics for 'Year' variable
dat_m['years'].describe()

count    7448.000000
mean        6.086332
std         6.700758
min         0.000000
25%         2.000000
50%         4.000000
75%         8.000000
max        62.000000
Name: years, dtype: float64

In [141]:
#Replacing missing values
#dat_m['years']=dat_m['years'].fillna(np.median(dat_m['years']))
dat_m['years']=dat_m['years'].fillna(dat_m['years'].median())
#categorical :fillna(data[''].mode())
#dat_m['years']=dat_m['years'].fillna(4)

In [142]:
dat_m['years'].median()

4.0

# Reshaping data frames 
https://pythonhealthcare.org/2018/04/08/32-reshaping-pandas-data-with-stack-unstack-pivot-and-melt/

In [145]:
dat_m.head(2)

   default  amount grade  years ownership   income  age
0        0    1000     B    2.0      RENT  19200.0   24
1        1    6500     A    2.0  MORTGAGE  66000.0   28

In [148]:
# Unsterstanding STACK operation
df_stacked = dat_m.stack()
df_stacked.head(10)

0  default          0
   amount        1000
   grade            B
   years            2
   ownership     RENT
   income       19200
   age             24
1  default          1
   amount        6500
   grade            A
dtype: object

In [150]:
# Understanding the unstacked operation 
df_unstacked = df_stacked.unstack()
df_unstacked.head()

  default amount grade years ownership income age
0       0   1000     B     2      RENT  19200  24
1       1   6500     A     2  MORTGAGE  66000  28
2       0   2400     A     2      RENT  60000  36
3       0  10000     C     3      RENT  62000  24
4       1   4000     C     2      RENT  20000  28

# Pivot table
pandas.pivot(index, columns, values) function produces pivot table based on 
3 columns of the DataFrame.

Uses unique values from index / columns and fills with values.

Python Pandas function pivot_table help us with the summarization and
conversion of dataframe in long form to dataframe in wide form, 
in a variety of complex scenarios.

In [151]:
data_url = 'http://bit.ly/2cLzoxH'
gapminder = pd.read_csv(data_url)
print(gapminder.head(3))

       country  year         pop continent  lifeExp   gdpPercap
0  Afghanistan  1952   8425333.0      Asia   28.801  779.445314
1  Afghanistan  1957   9240934.0      Asia   30.332  820.853030
2  Afghanistan  1962  10267083.0      Asia   31.997  853.100710

In [152]:
pd.pivot_table(gapminder,index='country', values='lifeExp',
                         columns='continent').head()

continent       Africa   Americas       Asia     Europe  Oceania
country
Afghanistan        NaN        NaN  37.478833        NaN      NaN
Albania            NaN        NaN        NaN  68.432917      NaN
Algeria      59.030167        NaN        NaN        NaN      NaN
Angola       37.883500        NaN        NaN        NaN      NaN
Argentina          NaN  69.060417        NaN        NaN      NaN

In [ ]:
df1 = gapminder[['continent', 'year','lifeExp']]
# pivot table example with three columns
pd.pivot_table(df1, values='lifeExp', index=['year'], columns='continent')
                                                .head()

More use cases of the pivot_table function could be used

https://pbpython.com/pandas-pivot-table-explained.html

#cross tab cross tabulation is a method to quantitatively analyze the relationship between multiple variables

In [154]:
import pandas as pd
import numpy as np
 
#Create a DataFrame
d = {
    'Name':['Alisa','Bobby','Cathrine','Alisa','Bobby','Cathrine',
            'Alisa','Bobby','Cathrine','Alisa','Bobby','Cathrine'],
    'Exam':['Semester 1','Semester 1','Semester 1','Semester 1','Semester 1','Semester 1',
            'Semester 2','Semester 2','Semester 2','Semester 2','Semester 2','Semester 2'],
     
    'Subject':['Mathematics','Mathematics','Mathematics','Science','Science','Science',
               'Mathematics','Mathematics','Mathematics','Science','Science','Science'],
   'Result':['Pass','Pass','Fail','Pass','Fail','Pass','Pass','Fail','Fail','Pass','Pass','Fail']}
 
df = pd.DataFrame(d,columns=['Name','Exam','Subject','Result'])

# 2 Way Cross table in python pandas:

In [155]:
#By default computes a frequency table of the factors
#calculate the cross table of subject and result

pd.crosstab(df.Subject, df.Result,margins=True)
#margin=True displays the row wise /column wise sum of the cross table 
#index  -- array-like, Series, or list of arrays/Series Values to group by in the rows.

#columns   -- array-like, Series, or list of arrays/Series Values to group by in the columns.

Result       Fail  Pass  All
Subject
Mathematics     3     3    6
Science         2     4    6
All             5     7   12

In [156]:
#3 Way Cross table in python pandas:
pd.crosstab([df.Subject, df.Exam],df.Result, margins=True)

Result                  Fail  Pass  All
Subject     Exam
Mathematics Semester 1     1     2    3
            Semester 2     2     1    3
Science     Semester 1     1     2    3
            Semester 2     1     2    3
All                        5     7   12

In [ ]:
#Which segment of customers get the max discount in terms of discount percentage per segment 

data1=store.groupby("Segment",as_index=False).agg({'Discount':np.mean})
print(store.groupby("Segment",as_index=False).agg({'Discount':np.max}).shape[0]/store.shape[0])
print(data1['Discount']/store.shape[0])